## 09/29/17 ##

### set data ###
http://download.nust.na/pub6/mysql/tech-resources/articles/mysql-set-datatype.html
https://codefights.com/arcade/db/specialties/nhGPHWsjFoLb3A4AJ/solutions/f8CMg5HHw86YWht5C

## 09/28/17 ##

### sum all the values in the column, using round, exp, sum, and log ###
https://codefights.com/arcade/db/time-for-tricks/wcjiSDNohjXc2tpQM/solutions
/*Please add ; after each select statement*/
CREATE PROCEDURE combinationLock()
BEGIN
select round(exp(sum(log(LENGTH(characters))))) as combinations
from discs;
	
END

### if condition in select, and sum the count
DROP PROCEDURE IF EXISTS legsCount;
CREATE PROCEDURE legsCount()
    SELECT SUM(IF(type = 'human', 2, 4)) as summary_legs
    FROM creatures
    ORDER BY id;

DROP PROCEDURE IF EXISTS legsCount;
CREATE PROCEDURE legsCount()
    SELECT 
        SUM(IF(type = 'human', 2, 0)
           +IF(type = 'cat', 4, 0)
           +IF(type = 'dog', 4, 0))
as summary_legs
    FROM creatures
    ORDER BY id;


### match keyword, regular expression

/*Please add ; after each select statement*/
CREATE PROCEDURE nullIntern()
BEGIN
    select count(id) number_of_nulls
        from departments
        where description is null 
           or trim(description) in ('null', 'nil', '-');  
END

CREATE PROCEDURE nullIntern()
BEGIN
select count(*) as number_of_nulls
from departments
where description is Null
or description regexp '^[[:space:]]*null[[:space:]]*$'
or description regexp '^[[:space:]]*nil[[:space:]]*$'
or description regexp '^[[:space:]]*-[[:space:]]*$'
;
	
END


### update the query of existing table
https://codefights.com/arcade/db/time-for-tricks/qAXNmPJATv6vQJ4DH/solutions/6xyZGv4GfsjT48HMu
CREATE PROCEDURE websiteHacking()
    SELECT id,login,name
    FROM users
    WHERE type='user'
    OR true
    ORDER BY id


### add total to the end of table
https://codefights.com/arcade/db/group-dishes-by-type/47JJ5SEJHSdLusQeQ/description

/*Please add ; after each select statement*/
CREATE PROCEDURE marketReport()
BEGIN
	select ifnull(country, "Total:") as country, count(competitor) as competitors
    from foreignCompetitors
    group by country
    with rollup;
END

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE soccerPlayers()
    SELECT GROUP_CONCAT(
        CONCAT(first_name, " ", surname, " #", player_number)
        ORDER BY player_number 
        SEPARATOR "; "
    ) AS players
    FROM soccer_team;

In [ ]:

select * from soccer_team order by player_number asc;

select group_concat( first_name, " ", surname, " #", player_number) as players
from (select * from soccer_team order by player_number asc) hi;

## group_concat ##

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE travelDiary()
BEGIN
	
select group_concat(distinct country order by country separator ';') 
as countries 
from diary  
group by null;

END


/*Please add ; after each select statement*/
CREATE PROCEDURE travelDiary()

BEGIN

select group_concat(thisss separator ';' ) as countries
from 
(select distinct country as thisss
from diary
order by country asc) x;
	
END

### count, group by, order by ###

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE itemCounts()
BEGIN
select item_name, item_type, count(*) as item_count
from availableItems
group by item_name, item_type
order by item_type, item_name;
	
END

### sum, average ###

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE countriesInfo()
BEGIN
	
select count(*) as number, avg(population) as average, sum(population) as total from countries;

END

/*Please add ; after each select statement*/
CREATE PROCEDURE countriesInfo()
BEGIN
    select count(*) as number, 
           sum(population)/count(*) as average,
           sum(population) as total
from countries;
	
END

### combine two tables ###
https://stackoverflow.com/questions/16117306/combine-two-mysql-table-with-same-column-name

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE newsSubscribers()
    SELECT DISTINCT subscriber
    FROM
    (
        SELECT *
        FROM full_year
            UNION
        SELECT *
        FROM half_year
    ) x
    WHERE newspaper LIKE "%Daily%"
    ORDER BY subscriber ASC;

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE newsSubscribers()
BEGIN
    select distinct subscriber
    from
        (
            select 'full_year' sub_type, newspaper, subscriber
            from full_year
            union all
            select 'half_year' sub_type, newspaper, subscriber
            from half_year
        ) combined
    where newspaper like '%Daily%'
    order by subscriber asc  ##, newspaper, field(sub_type, 'full_year', 'half_year');
END

### arithmetic operator as a column value, create function ###

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE expressionsVerification()
BEGIN
	select * 
        from expressions
        where elt(locate(operation, "+-*/"), a+b, a-b, a*b, a/b) = c;
END

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE expressionsVerification()
BEGIN
    SELECT *
    FROM expressions
    WHERE calc(a,b,operation) = c
    ORDER BY id;    
END;

CREATE FUNCTION calc ( a DOUBLE, b DOUBLE, op varchar(1) ) RETURNS DOUBLE
BEGIN
    CASE op
        WHEN "+" THEN SET @calc = a+b;
        WHEN "-" THEN SET @calc = a-b;
        WHEN "*" THEN SET @calc = a*b;
        WHEN "/" THEN SET @calc = a/b;
    END CASE;
   RETURN @calc;
END;

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE expressionsVerification()
BEGIN
    SELECT * FROM expressions
        WHERE (operation = '+' AND a + b = c) OR 
              (operation = '-' AND a - b = c) OR 
              (operation = '*' AND a * b = c) OR
              (operation = '/' AND b != 0 AND C * b = a);
END

### select if is null ###

In [ ]:
CREATE PROCEDURE testCheck()
    SELECT id, IF ( given_answer IS NULL, 'no answer', IF ( given_answer = correct_answer, 'correct','incorrect') ) AS checks
    FROM answers
    ORDER BY id

### case sensitive ###

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE securityBreach()
BEGIN
	select first_name, second_name, attribute from users
    where
       attribute like BINARY concat('_%\%',first_name,'\_',second_name,'\%%');
END

/*Please add ; after each select statement*/
CREATE PROCEDURE securityBreach()
BEGIN
select * from users
where attribute like concat('%_%', '\%', `first_name`, '\_', `second_name`, '\%', '%') COLLATE utf8_bin;

END

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE mischievousNephews()
BEGIN
    SELECT
        WEEKDAY(mischief.`mischief_date`) AS `weekday`,
        mischief.*
    FROM
        mischief
    ORDER BY
        `weekday` ASC,
        FIELD(mischief.`author`, 'Huey', 'Dewey', 'Louie'),
        mischief.`mischief_date`,
        mischief.`title` ASC;
END

/*Please add ; after each select statement*/
CREATE PROCEDURE mischievousNephews()
BEGIN
    select weekday(mischief_date) as weekday, mischief_date, author, title
    from mischief
    order by 
        weekday,
        length(author),
        author,
        mischief_date,
        title;
END

In [ ]:
/*Please add ; after each select statement*/
CREATE PROCEDURE gradeDistribution()
BEGIN
	
select Name, ID from Grades where Final > (Midterm1+Midterm2)/2 and Final > (Final*2 + Midterm1+Midterm2)/4 order by substring(Name, 1, 3), id;

END

/*Please add ; after each select statement*/
CREATE PROCEDURE gradeDistribution()
BEGIN

select Name, ID from ((select Name, ID, 
Midterm1*0.25+Midterm2*0.25+Final*0.5 as option1,
Midterm1*0.5+Midterm2*0.5 as option2,
Final as option3
from Grades) as selected)
where option3 > option1 and option3 > option2
order by Left(Name, 3) ASC, ID;
	
END